import React from 'react';
import {styled} from '@mui/system';

const AboutBlock = styled('div')({
    display: 'flex',
    justifyContent: 'center',
    alignItems: 'center',
    flexDirection: 'column',
    paddingTop: '70px',
    paddingBottom: '180px',
});

const TextBlock = styled('div')({
    display: 'flex',
    justifyContent: 'center',
    alignItems: 'center',
    flexDirection: 'column',
    width: '100%',
    gap: '35px',
});

const Title = styled('h1')(({theme}) => ({
    fontSize: '64px',
    fontWeight: '600',
    color: '#231f20',
    [theme.breakpoints.down('lg')]: {
        fontSize: '48px',
    },
    [theme.breakpoints.down('md')]: {
        fontSize: '32px',
    },
}));

const Description = styled('p')(({theme}) => ({
    fontSize: '32px',
    fontWeight: '400',
    lineHeight: 'normal',
    color: '#231f20',
    [theme.breakpoints.down('lg')]: {
        fontSize: '24px',
        textAlign: 'justify',
    },
    [theme.breakpoints.down('md')]: {
        fontSize: '18px',
    },
}));

const AboutImage = styled('img')({
    width: '100%',
});

const About: React.FC = () => {
    return (
        <AboutBlock>
            <AboutImage src="/about-us-big-image.png" alt="About Us Image"/>
            <TextBlock>
                <Title>Про нас</Title>
                <Description>
                    У компанії Hyggy ми робимо все можливе, щоб ваш будинок став не лише комфортним,
                    але й стильним, адже ми віримо, що кожен дім заслуговує на особливу атмосферу,
                    де кожен предмет в інтер'єрі має своє місце і значення. Ми прагнемо допомогти вам
                    створити затишок, який буде радувати вас щодня, тому ми пропонуємо широкий асортимент меблів,
                    що відповідають найвищим стандартам якості та дизайну. У нашому магазині ви знайдете меблі
                    від перевірених, надійних виробників, що гарантують довговічність, практичність та естетичну
                    привабливість своєї продукції. Ми працюємо для того, щоб у вас був вибір, який відповідає вашим
                    індивідуальним смакам та бюджетним можливостям. У нас ви знайдете меблі для різних стилів інтер'єру:
                    від класики до сучасних трендів, які легко впишуться у будь-який простір,
                    будь то затишна квартира чи просторий будинок.
                </Description>
                <Description>
                    Ми пишаємося тим, що наш асортимент включає елементи, здатні задовольнити найвищі вимоги
                    навіть найвибагливіших клієнтів. У нашій колекції ви знайдете все: від стильних диванів,
                    ергономічних крісел до елегантних шаф та функціональних столів, що не тільки додають естетики,
                    але й забезпечують комфорт в кожному куточку вашого дому. Ми розуміємо, що купівля меблів – це
                    завжди важлива подія в житті кожної людини, і це не просто про покупку нового предмета. Це про
                    створення простору, де ви будете проводити свій час з родиною, друзями, де будете відпочивати та
                    працювати. Саме тому ми намагаємось зробити цей процес не лише зручним, а й приємним. Вибір меблів
                    для вашого дому не повинен бути стресом, тому ми зробимо все можливе, щоб вам було легко
                    орієнтуватися в нашому асортименті та знаходити саме те, що ви шукаєте.
                </Description>
                <Description>
                    Наша команда професіоналів завжди готова допомогти вам на кожному етапі покупки: від консультацій
                    щодо вибору меблів до допомоги в доставці та монтажу. Ми знаємо, як важливо мати підтримку в
                    такому відповідальному процесі, тому ми надаємо індивідуальний підхід до кожного клієнта.
                    Ви можете звернутись до нас з будь-яким питанням, і ми з радістю надамо вам всю необхідну
                    інформацію, щоб зробити вашу покупку максимально комфортною і безтурботною. Ми завжди приділяємо
                    особливу увагу кожному клієнту, адже нашою метою є не просто продаж меблів, а створення для вас
                    ідеальних умов для стильного, комфортного і сучасного життя. Ми розуміємо, що ваш дім — це місце,
                    де ви повинні почуватися в безпеці та гармонії, і тому ми дбаємо про те, щоб кожен елемент в
                    ньому був не лише красивим, але й функціональним. З нами ви можете бути впевнені, що кожна
                    покупка буде виправдовувати ваші очікування.
                </Description>
            </TextBlock>
        </AboutBlock>
    );
};

export default About;